rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "nil"], ["created_at", "2016-02-29 21:26:05.766397"], ["updated_at", "2016-02-29 21:26:05.766397"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
---
  def similar
   # debugger
    @id = params[:movie_id]
    @movie = Movie.find(@id)